[{"id":"blog-0","title":"Adding Multiple Currencies or Dynamic Pricing on Shopify","slug":"shopify-multiple-currencies-dynamic-pricing","subtitle":"In this article, we’ll dive into how you can add multiple currencies and implement dynamic pricing on Shopify, ensuring you provide a smoother, more personalized experience for your customers while also boosting your sales.","image":"https://cdn.sanity.io/images/cxeknc6v/production/ed3a48902be7fb59c84277fec3e15455a899a9d7-1280x1920.png?rect=0,107,1280,1707&w=600&h=800&auto=format","type":"blog-post_studio"},{"id":"blog-1","title":"Maximizing Conversion Rates with Effective Ecommerce Website Design","slug":"maximizing-conversion-with-design","subtitle":"Thoughtful, conversion-focused design strategy is critical to a brand’s ecommerce success.","image":"https://cdn.sanity.io/images/cxeknc6v/production/82965169e71fd7086d551f4b179406003d8c2235-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_studio"},{"id":"blog-2","title":"Shopify or Adobe Commerce (Magento): Choosing the Best Ecommerce Platform for Your Brand","slug":"shopify-vs-adobe","subtitle":"Compare Shopify and Adobe Commerce (Magento) with our latest blog article. Discover key differences in total cost of ownership, customization, and tech stack so that you can choose the best ecommerce platform for your brand.","image":"https://cdn.sanity.io/images/cxeknc6v/production/034394dee801e1bdb0162054106b7b12a16c4c86-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-3","title":"Domaine Acquires Code, Expanding European Shopify Practice and Engineering Expertise","slug":"domaine-acquires-code","subtitle":"Domaine Worldwide, the leading global Shopify design and development practice, today announced its acquisition of Code, one of Europe’s top Shopify agencies. This strategic move expands Domaine’s international footprint with a new operational hub in the Netherlands and reinforces its commitment to serving commerce brands with both regional expertise and global scale.","image":"https://cdn.sanity.io/images/cxeknc6v/production/6b84804e13d0c08399bccac240c2553140068b91-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-4","title":"Domaine Migrations: BigCommerce to Shopify for Enterprise Brands ","slug":"bigcommerce-to-shopify-enterprise-migration","subtitle":"Enterprise ecommerce brands are at an inflection point. With increasing complexity in infrastructure, scaling demands, and customer expectations, many are realizing that platforms that once promised extensibility and control, like BigCommerce, are becoming roadblocks rather than accelerators.","image":"https://cdn.sanity.io/images/cxeknc6v/production/eded17ac4740a51747c480459f9a258d4c2dc97f-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-5","title":"Tomorrow and Half Helix Announce Merger to Create Largest Independent Partner Serving Shopify Enterprise Brands","slug":"tomorrow-and-half-helix-announce-merger","subtitle":"Tomorrow and Half Helix today announced a merger of the two companies that creates the largest Shopify design and development practice in the world.","image":"https://cdn.sanity.io/images/cxeknc6v/production/7ac412628321e492fd3c5c47b84ae266a4501b2b-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-6","title":"Shopify New Customer Accounts: Powerful Updates to Boost Enterprise Growth","slug":"shopify-new-customer-accounts-vs-classic","subtitle":"Shopify has made it clear: new customer accounts are becoming the new standard. While Shopify classic accounts are still available, they won’t be around forever. Shopify hasn’t set a firm timeline for when, but merchants should begin planning for the transition now.","image":"https://cdn.sanity.io/images/cxeknc6v/production/b3ca00471a9d1cc03093ed6c40c232a18cd784df-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-7","title":"Domaine Deepens Investment in Commerce Personalization with CRM & Lifecycle Marketing Services","slug":"commerce-personalization-with-crm-and-lifecycle-marketing-services","subtitle":"Domaine deepens its investment into commerce marketing and personalization with a heightened focus on CRM and Lifecycle Marketing Services, providing brands with intelligent, cross-channel solutions that deliver a new level of personalization, innovation, and growth across the entire customer journey.","image":"https://cdn.sanity.io/images/cxeknc6v/production/673435b31199dea0a69253b38f7cbcfe1409fe4f-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-8","title":"Shopify Names Domaine Highest-Tier Platinum Partner for 2025","slug":"shopify-names-domaine-platinum-partner-2025","subtitle":"Domaine, the world's largest Shopify design and development practice, is proud to announce its recognition as a Platinum Tier Partner in the newly redefined Shopify Partner Program for 2025, further solidifying its position as an ecommerce industry leader.","image":"https://cdn.sanity.io/images/cxeknc6v/production/27d16d510c9d0c0a295f64e45e52d524ce920297-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-9","title":"Futureshift: The Commerce Evolution at Shoptalk 2025","slug":"futureshift-shoptalk-2025","subtitle":"We returned to Shoptalk with Futureshift, a follow-up to our brand launch celebration last year at Sphere. Alongside 250 leaders from the industry, we explored the evolution of commerce through a custom-built installation, cocktails, and a multi-sensory film experience.","image":"https://cdn.sanity.io/images/cxeknc6v/production/c9f32eab0ebaa86afef249f7972844ca8ade4a9f-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-10","title":"Figma Config 2023 Conference Recap by Domaine Design","slug":"figma-config-2023-conference-recap","subtitle":"Config is Figma’s annual flagship conference that gathers design and development enthusiasts from around the world. The updates and new features introduced this year have proven to be exceptionally significant, offering substantial improvements and advancements that facilitate seamless collaboration between teams.","image":"https://cdn.sanity.io/images/cxeknc6v/production/62d8b2e614e9833ed92feaae6daa035bec472d8d-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-11","title":"Launching the Domaine Partner Program: A New Era of Collaboration","slug":"launching-the-domaine-partner-program","subtitle":"At Domaine, partnerships are not just a facet of our business; they are its very foundation. Our journey has always been intertwined with those of our collaborators. Today, we announce the next phase in this journey: the launch of the Domaine Partner Program.","image":"https://cdn.sanity.io/images/cxeknc6v/production/aa01a9f1b0b7b3defb16cd7318c0858d6aeac309-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-12","title":"Unlocking Shopify Editions Winter '24","slug":"unlocking-shopify-editions-winter-24","subtitle":"Shopify Editions are back with another suite of updates and launches. Here are some of the highlights that caught our team’s attention.","image":"https://cdn.sanity.io/images/cxeknc6v/production/75b5780a1116b1d21f1e1b60801b0353fdeb9123-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-13","title":"Shopify Speed Optimization: Boost Your Store’s Performance","slug":"shopify-speed-optimization","subtitle":"Shopify speed optimization is the process of fine-tuning a Shopify store to ensure it loads quickly and efficiently. Here’s how Domaine’s team of engineering and technology experts approach website speed for brands on Shopify.","image":"https://cdn.sanity.io/images/cxeknc6v/production/fdc2aeb5e901a20ecdc4fccd4bb5e7b61f3dcef5-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_studio"},{"id":"blog-14","title":"Balancing Brand & Conversion: Crafting Ecommerce Experiences That Resonate & Convert","slug":"balancing-brand-and-conversion","subtitle":"Finding the sweet spot between a brand's identity and conversion goals is more art than science. At Domaine, we are passionate about mastering this balancing act, working with a diverse range of brands with unique goals and strategies to ensure their sites are as engaging as they are effective.","image":"https://cdn.sanity.io/images/cxeknc6v/production/73bbb80919dc6e7ae88b9bbe92cd7a00b68080b0-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-15","title":"Our Creative Team’s Top 5 New Figma Feature Updates","slug":"our-creative-team-s-top-5-new-figma-feature-updates","subtitle":"Over the past few months, Figma has introduced several new product features that our creative team has been excited to review and has already started to experiment with in our projects.","image":"https://cdn.sanity.io/images/cxeknc6v/production/b0b3183e471f1d437b78afe26ac03d38c6388908-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-16","title":"New Horizons: Domaine Expands to the United Kingdom","slug":"new-horizons-domaine-united-kingdom","subtitle":"Domaine marked its official UK expansion with New Horizons, an exclusive event at The Gherkin in London. Bringing together leading brands, partners, and commerce innovators, the evening featured insightful discussions, stunning city views, and a lively afterparty—setting the stage for the next chapter in global ecommerce.","image":"https://cdn.sanity.io/images/cxeknc6v/production/56aeb65f463399a4e8ae5285d4be8e810deb1d18-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-17","title":"Domaine Taps Industry Veterans to Lead Next Phase of Shopify B2B Growth","slug":"press-release-b2b","subtitle":"Domaine is making a significant investment in its business-to-business (B2B) offering, deepening its strategic partnership with Shopify. This move aims to further empower B2B companies, including manufacturers, distributors, and CPG brands, to grow revenue more efficiently by streamlining B2B operations and reducing the cost to serve wholesale customers.","image":"https://cdn.sanity.io/images/cxeknc6v/production/d5e0dfc0c631ccea41c6f3904cad71534935b1c7-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-18","title":"Shopify Plus Merchants: Shopify’s Checkout Extensibility Upgrade","slug":"shopify-checkout-extensibility-upgrade","subtitle":"As of August 2024, Shopify’s new Checkout Extensibility replaced checkout.liquid as the sole way for Shopify Plus merchants to tailor their checkout experience. Check out our blog article to learn more.","image":"https://cdn.sanity.io/images/cxeknc6v/production/81e9e049b6b384f98978e4ae5f58f33fdc2cd108-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-19","title":"Shopify Editions Summer ‘24: Key Announcements & Implications for Brands & Developers","slug":"shopify-editions-summer-2024","subtitle":"At Shopify Editions.dev, announcements as part of Editions Summer ‘24 have set the stage for exciting developments in the world of ecommerce. Our team breaks down the most impactful updates for brands and developers.","image":"https://cdn.sanity.io/images/cxeknc6v/production/932be750cda8f5ec6eed22876d96507097ffb709-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-20","title":"NRF '25: A Series of Unforgettable Events","slug":"nrf-25","subtitle":"From exclusive brunches to inspiring panels and dinners, Domaine partnered with industry leaders to create memorable moments at NRF 2025. Here's a recap of the week's highlights.","image":"https://cdn.sanity.io/images/cxeknc6v/production/afc09b2a320e4941789ed55fcf0681ffea4931ea-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-21","title":"Domaine Offsite 2024: Tulum","slug":"domaine-offsite-2024","subtitle":"Domaine’s first offsite in Tulum, Mexico, was more than just a company retreat—it was an experience that brought together a team from all corners of the globe. With diverse backgrounds and skill sets, we united in the vibrant atmosphere of Tulum, ready to connect, reflect, and envision the future together.","image":"https://cdn.sanity.io/images/cxeknc6v/production/2120d6d9a0309e39de35b86ff943b4eb75f7fe8b-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-22","title":"The Internationalization Guide for Brands on Shopify","slug":"internationalization-guide-for-shopify","subtitle":"Master global expansion with Shopify! Learn the essentials of catering to international customers, from localization to legal compliance, and expand your brand's reach today.","image":"https://cdn.sanity.io/images/cxeknc6v/production/35dfc875d49a182706c57a7f74b81447982f2cb0-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-23","title":"Migrating from Salesforce Commerce Cloud to Shopify","slug":"domaine-migrations-vol-001","subtitle":"Vol 001 of Domaine Migrations, our webinar series about migrating to Shopify. This episode features Orveon Global, a collective of premium cosmetics brands including bareMinerals, Laura Mercier, and Buxom Cosmetics.","image":"https://cdn.sanity.io/images/cxeknc6v/production/52a0ece820d2e45e1b55cb5e21daa11233f3fd27-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-24","title":"Shopify Frontend Architecture Options","slug":"shopify-front-end-architecture-options","subtitle":"Over the years, we’ve tried different frontend architecture to best serve the business needs.","image":"https://cdn.sanity.io/images/cxeknc6v/production/c6ceac521db2810b54d8c1577f15b67d3271e498-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-25","title":"How to Craft the Perfect Abandoned Cart Email Series to Drive Conversions","slug":"abandoned-cart-strategies","subtitle":"Abandoned cart emails & SMS messages are one of the most effective tools in your marketing arsenal to recover those nearly-lost sales. With the right sequence, design, and timing, you can transform hesitation into conversion.","image":"https://cdn.sanity.io/images/cxeknc6v/production/fd564bc1eae14a65a02ebe85de21cdcac2b5d211-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_studio"},{"id":"blog-26","title":"Shopify Summer Editions '25 @ Editions.dev: AI-first, Ecosystem-ready, and Built to Scale","slug":"shopify-editions-summer-2025","subtitle":"Explore the biggest updates from Shopify Editions Summer 2025—from AI-powered Sidekick and the new Horizon theme to ecosystem upgrades like Shop Pay and campaign orchestration. Discover what the industry thought of the updates with our coverage at Editions.dev in Toronto.","image":"https://cdn.sanity.io/images/cxeknc6v/production/dd446a80f27b55f207feee773563e5e9978c8368-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-27","title":"Curated by Domaine: our Inaugural Client Summit","slug":"curated-by-domaine-25","subtitle":"On Tuesday February 18, 2025, we hosted our inaugural client summit, Curated by Domaine, to give the people behind the inspiring brands we work with an opportunity to have insightful conversations and network with each other. The event featured a thoughtfully designed agenda tailored to the themes we’ve heard directly from our clients.","image":"https://cdn.sanity.io/images/cxeknc6v/production/c3344bfcfbff688c8ea935f7235800e758858ee6-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-28","title":"Navigating GDPR Compliance with Google Analytics: What You Need to Know for Your Shopify Store","slug":"gdpr-compliance-with-google-analytics-on-shopify","subtitle":"The rollout of Google Analytics 4 (GA4) has introduced new complexities to managing consent for brands that need to comply with the General Data Protection Regulation (GDPR) and other laws, including the California Consumer Privacy Act (CCPA), that may indicate additional requirements. While GA4 provides valuable insights into customer behavior, its US-based data storage and data transfer practices can complicate compliance for Shopify merchants doing business in the European Economic Area (EEA) regions.","image":"https://cdn.sanity.io/images/cxeknc6v/production/6805d46f2bb73a97e23c4b1a08c2b8ee36143bb6-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_studio"},{"id":"blog-29","title":"Shopify ERP Integrations: How to Customize & Save Costs","slug":"shopify-erp-integrations","subtitle":"For brands at the enterprise level, integrating Shopify into an ERP can unlock its full potential, enabling you to build online stores, sell globally, manage inventory, and often reduce total cost of ownership with less custom code.","image":"https://cdn.sanity.io/images/cxeknc6v/production/044a36c2bf620e4f75e34d1138161b722f90f047-5000x3333.jpg?rect=1339,307,2270,3026&w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-30","title":"Shopify or Salesforce Commerce Cloud… Which Ecommerce Platform is Right for Your Brand?","slug":"shopify-vs-sfcc","subtitle":"Compare Shopify and Salesforce Commerce Cloud (SFCC) with our latest blog article and downloadable white paper. Discover key differences in ease of use, customization, and support so that you can choose the best ecommerce platform for your brand.","image":"https://cdn.sanity.io/images/cxeknc6v/production/1e26c929524aac94e1a626cac122ce80439ef822-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-31","title":"Driving Engagement Through Design","slug":"driving-engagement-ecommerce-design","subtitle":"Let’s dig into why engagement is so valuable (beyond the obvious), how UX/UI design in Shopify is built for influencing engagement, and the most common mistakes to avoid.","image":"https://cdn.sanity.io/images/cxeknc6v/production/4d20e67364a55f1eb339a2bb61eadbebc11282eb-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_studio"},{"id":"blog-32","title":"Simplify Shopping This Holiday Season: Domaine’s Multi-Ship Implementation for Shopify Stores","slug":"domaine-multi-ship-implementation","subtitle":"This solution gives your customers the ability to send products to multiple addresses from a single order and with a single checkout. Customers can set an address for each individual item in their cart, group items going to a single address, quickly select from saved addresses, select a unique shipping rate per destination, and add a personalized gift message.","image":"https://cdn.sanity.io/images/cxeknc6v/production/25bf99ce784a4bdb81e8ad66d6da5d553495e184-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-33","title":"An Evening with Domaine: A Brand Launch Celebration at Shoptalk","slug":"an-evening-with-domaine-las-vegas","subtitle":"At Shoptalk 2024, we introduced Domaine to the commerce industry. As the largest independent Shopify design and development partner in the world, we celebrated with a series of spectacular events for brands, clients, partners, and importantly, our team.","image":"https://cdn.sanity.io/images/cxeknc6v/production/ecedb875b6a60fe63a60fa577ebdc90743b570b8-5883x3922.jpg?rect=1089,0,2942,3922&w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-34","title":"The Ideal Ecommerce Org Structure","slug":"the-ideal-ecom-org-structure","subtitle":"A common question from our mid-to-large-sized clients is about how to structure their ecommerce teams. And one that we’re hearing at Domaine more frequently as companies put a renewed focus on digital.","image":"https://cdn.sanity.io/images/cxeknc6v/production/0f89f910943be12eb09bc90d8e810e5ba713feb7-5000x3333.jpg?rect=1926,0,2500,3333&w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-35","title":"The True Meaning of Customization on Shopify: Custom vs “Out-of-The-Box” Themes","slug":"shopify-custom-vs-out-of-the-box-themes","subtitle":"In this article, we break down the differences between creating a custom theme versus using an out-of-the-box theme on Shopify. We address common misconceptions about the Shopify platform’s customization potential within its native content management system (CMS).","image":"https://cdn.sanity.io/images/cxeknc6v/production/449de1f33ceff735534b49c221db70df8fe96d89-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-36","title":"Domaine Wins Best Mobile User Experience in the 28th Annual Webby Awards","slug":"webby-awards-timex","subtitle":"Domaine wins the Webby People’s Voice Award for Best Mobile UX with their innovative Timex site redesign.","image":"https://cdn.sanity.io/images/cxeknc6v/production/bc44fa1bf9695166cef02e7aef435c8401bdded6-6142x4607.jpg?rect=1365,0,3455,4607&w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-37","title":"Migrating From a Custom Commerce Platform to Shopify","slug":"domaine-migrations-vol-002","subtitle":"Vol 002 of Domaine Migrations, our webinar series about migrating to Shopify. This episode features Daily Harvest, diving into their migration from a custom commerce platform to Shopify.","image":"https://cdn.sanity.io/images/cxeknc6v/production/adad0e8a1a54b0713da022d6687c3349dd849765-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-38","title":"Tariffs Are Rising; Learn How Large DTC Brands Are Navigating Changes and Rising Costs","slug":"tariffs-are-rising","subtitle":"Tariff policies and global trade dynamics are shifting quickly. With new US tariff expansions on Chinese goods and growing restrictions on the $800 de minimis loophole, ecommerce brands are entering a new era of cost pressure, longer lead times, and increasingly price-sensitive consumers.","image":"https://cdn.sanity.io/images/cxeknc6v/production/1246b9b5ef9c97c9ba53683b45058cd150188c94-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-39","title":"Mastering Shopify Product Schema: Boost SEO and Sales with Structured Data","slug":"shopify-product-schema-for-seo","subtitle":"In this article, we’ll dive into what product schema is, why it matters, how to implement it, and how to fix common issues. By the end, you’ll be equipped to use structured data effectively to boost your Shopify store’s performance.","image":"https://cdn.sanity.io/images/cxeknc6v/production/afb8076e8b32d8d678b95a373197328775493af9-1280x1920.png?rect=0,107,1280,1707&w=600&h=800&auto=format","type":"blog-post_studio"},{"id":"blog-40","title":"Domaine Appoints Marko Bon as President & Dave Finnie as CFO","slug":"marko-bon-president-dave-finnie-cfo","subtitle":"Today, Domaine is publicly announcing the appointment of Marko Bon as President and Dave Finnie as Chief Financial Officer (CFO).","image":"https://cdn.sanity.io/images/cxeknc6v/production/b165316ee9a7840a17a0df4467afd04bba5bf749-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-41","title":"The New Domaine Site: Designed for the Shopify Ecosystem","slug":"the-new-domaine-site","subtitle":"With this new site, we’re establishing our global scale & commerce expertise  across industries and verticals. We believe the new design communicates the breadth and depth of our experience, while also showcasing the flexibility and adaptability of the new Domaine brand system.","image":"https://cdn.sanity.io/images/cxeknc6v/production/f3bce000c766cdc5c2c65d04d1e4d907aa7569ca-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-42","title":"How Beauty Brands Become Market Leaders","slug":"how-beauty-brands-become-market-leaders","subtitle":"Discover the key strategies behind building a market-leading beauty brand. From DTC growth and global expansion to AI-driven personalization and omnichannel success, our latest white paper reveals how top beauty brands stay ahead.","image":"https://cdn.sanity.io/images/cxeknc6v/production/349e9e97fd0c735f3d8d446345b131b541f16c15-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-43","title":"Crafting Long-Term Project Success: Time Management & Strategic Planning","slug":"crafting-long-term-project-success-time-management-and-strategic-planning","subtitle":"This article provides a view into some of our delivery team’s key areas of focus around finding success in strategic project management — emphasizing the role of version control in front-end implementations, tackling team challenges, and ultimately orchestrating successful releases.","image":"https://cdn.sanity.io/images/cxeknc6v/production/a6340035a38780733d09661ce10c77c160fea310-2460x3691.jpg?rect=0,369,2460,3280&w=600&h=800&auto=format","type":"blog-post_domaine"},{"id":"blog-44","title":"Introducing Domaine Studio: Enterprise-Level Expertise for Emerging to Mid-Market Brands","slug":"introducing-domaine-studio","subtitle":"Domaine is thrilled to announce the launch of Domaine Studio—a new division tailored to the unique needs of emerging to mid-market brands looking to scale on Shopify with confidence. Domaine Studio brings enterprise-level expertise to this market, offering an efficient, streamlined path to high-quality ecommerce services that are designed to grow.","image":"https://cdn.sanity.io/images/cxeknc6v/production/74d41858d3db5e16994248ee31b03eaa34d2c179-1440x1920.png?w=600&h=800&auto=format","type":"blog-post_domaine"}]